<?php

namespace Stub\Framework\Console\Base;

/**
 * --------------------------------------------------------------------------
 * Данный класс - предназначен для облегчения декорирования и форматирования результатов вывода строковых данных в консоль
 * --------------------------------------------------------------------------
 *
 * Для тестирования и обкатки решений по выделению полезных общих функций по
 * декорированию вывода данных в консоль данный класс внедрен в проект SimpleStub
 * так сказать напрямую, в дальнейшем данный класс иже с ним планируется оформить отдельной
 * библиотекой
 *
 */
class StringDecorator
{

}